In [1]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [2]:
url = 'https://en.wikipedia.org/wiki/2024_Summer_Olympics_medal_table#Medal_table'
response = requests.get(url)
soup = BeautifulSoup(response.text, "html.parser")

In [3]:
table = soup.find('table', {'class': 'wikitable'})
df = pd.read_html(str(table))[0]
df.head(4)

  Rank            NOC  Gold  Silver  Bronze  Total
0    1  United States    40      44      42    126
1    2          China    40      27      24     91
2    3          Japan    20      12      13     45
3    4      Australia    18      19      16     53

In [4]:
url2 = 'https://en.wikipedia.org/wiki/Demographics_of_the_Arab_world'
response2 = requests.get(url2)
soup2 = BeautifulSoup(response2.text, "html.parser")
table2 = soup2.find('table', {'class': 'wikitable'})
df_arab = pd.read_html(str(table2))[0]

In [5]:
arab_countries = []
for country in df_arab['Country']:
    arab_countries.append(country)

In [6]:
new_df = pd.DataFrame()
for country in arab_countries:
    entry = df[df['NOC'] == country]
    new_df= new_df.append( [entry] )

In [7]:
final_df = new_df.sum()

In [8]:
final_df['NOC'] = 'Arab'

In [9]:
df = df.append(final_df, ignore_index=True)

In [10]:
df.tail(5)

                   Rank                  NOC  Gold  Silver  Bronze  Total
89                   84            Singapore     0       0       1      1
90                   84             Slovakia     0       0       1      1
91                   84               Zambia     0       0       1      1
92  Totals (91 entries)  Totals (91 entries)   329     330     385   1044
93       39335274608452                 Arab     7       4       6     17

In [11]:
data = df.drop("Rank", axis='columns')

In [12]:
data = data.set_index('NOC')

In [13]:
data = data.sort_values(by='Total', ascending=False)

In [14]:
data = data.reset_index()

In [15]:
data.head(4)

                   NOC  Gold  Silver  Bronze  Total
0  Totals (91 entries)   329     330     385   1044
1        United States    40      44      42    126
2                China    40      27      24     91
3        Great Britain    14      22      29     65

In [16]:
data['NOC'].tolist().index('Arab')

16

In [17]:
data[data["NOC"] == 'Arab']

     NOC  Gold  Silver  Bronze  Total
16  Arab     7       4       6     17

In [18]:
new_df

   Rank      NOC  Gold  Silver  Bronze  Total
38   39  Algeria     2       0       1      3
32   33  Bahrain     2       1       1      4
53   52    Egypt     1       1       1      3
76   74   Jordan     0       1       0      1
61   60  Morocco     1       0       1      2
87   84    Qatar     0       0       1      1
54   52  Tunisia     1       1       1      3